OdDAI.Select.setHandleD(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the specific underlying type enum for the stored handle.

OdDAI.Select.getValue(OdRxValue*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as an OdRxValue object.
\param getTo [out] A placeholder for the value to be returned to a calling subroutine.
\returns true if the value was successfully extraced and returned to a calling subroutine; otherwise, the method returns false.